# Join`s

##### Импорт библиотек

In [1]:
import pandas as pd
import numpy as np
import sqlite3

In [2]:
sqlite3.sqlite_version

'3.37.2'

##### Подключение к БД

In [3]:
con = sqlite3.connect('db')

## Colab

In [5]:
! gdown --id 1cUYNwlHjUZ6gZZMSFBdX0NCnvgRTprsQ

df = pd.read_csv('/content/german_credit_augmented.csv')

"gdown" ­Ґ пў«пҐвбп ў­гваҐ­­Ґ© Ё«Ё ў­Ґи­Ґ©
Є®¬ ­¤®©, ЁбЇ®«­пҐ¬®© Їа®Ја ¬¬®© Ё«Ё Ї ЄҐв­л¬ д ©«®¬.

FileNotFoundError: [Errno 2] No such file or directory: '/content/german_credit_augmented.csv'

## Pycharm

In [5]:
df = pd.read_csv(
    r'C:\Python\SQL_for_data_analysis\2.DB_connect_and_upload\sql-course-main\german_credit_augmented.csv')

In [6]:
df

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,NaN,NaN,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,NaN,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,NaN,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,NaN,776,12,radio/TV,0,2007-07-21 13:22:14,358
...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
998,29,female,2,own,NaN,NaN,5003,21,car,1,2007-11-29 15:51:45,557
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

In [7]:
df.dtypes

age                  int64
sex                 object
job                  int64
housing             object
saving_accounts     object
checking_account    object
credit_amount        int64
duration             int64
purpose             object
default              int64
contract_dt         object
client_id            int64
dtype: object

In [8]:
df.contract_dt = pd.to_datetime(df.contract_dt, format='%Y-%m-%d %H:%M:%S')

In [9]:
df.dtypes

age                          int64
sex                         object
job                          int64
housing                     object
saving_accounts             object
checking_account            object
credit_amount                int64
duration                     int64
purpose                     object
default                      int64
contract_dt         datetime64[ns]
client_id                    int64
dtype: object

In [10]:
df.to_sql('german_credit', con, index=False, if_exists='replace')

1000

In [11]:
def select(sql):
    return pd.read_sql(sql, con)

## Джойны
С помощью джойнов можно подтягивать информацию из разных таблиц в одну таблицу

In [12]:
sql = '''select * from german_credit t
limit 5'''

In [13]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358

**Создадим такую же таблицу как и в google sheets (Start join)**

In [14]:
users = pd.DataFrame({'id': [1, 2, 3], 'name': ['gleb', 'jon snow', 'tyrion']})
items = pd.DataFrame({'user_id': [1, 3], 'item_name': ['hleb', 'gold'], 'value': [5, 100]})

In [15]:
users

   id      name
0   1      gleb
1   2  jon snow
2   3    tyrion

In [16]:
items

   user_id item_name  value
0        1      hleb      5
1        3      gold    100

**Зальём таблички в SQL**

In [17]:
users.to_sql('users', con, index=False, if_exists='replace')

3

In [18]:
items.to_sql('items', con, index=False, if_exists='replace')

2

**Выведу обе таблички:**

In [19]:
sql = '''select * from users t'''

In [20]:
select(sql)

   id      name
0   1      gleb
1   2  jon snow
2   3    tyrion

In [21]:
sql = '''select * from items t'''

In [22]:
select(sql)

   user_id item_name  value
0        1      hleb      5
1        3      gold    100

#### Left join

**Подтяну информацию из одной таблички в другую с помощью Join**

In [23]:
sql = '''select t.*, i.item_name from users t
left join items i on t.id = i.user_id'''

In [24]:
select(sql)

   id      name item_name
0   1      gleb      hleb
1   2  jon snow      None
2   3    tyrion      gold

#### Inner join

**Проделаем туже операцию, но с inner join:**

In [29]:
sql = '''select t.*, i.item_name from users t
inner join items i on t.id = i.user_id'''

In [30]:
select(sql)

   id    name item_name
0   1    gleb      hleb
1   3  tyrion      gold

**В результате inner joina ↑ остались только те строки, у которых есть значения, а строки с None не были включены!**

**Можно сымитировать inner join в left join`e с помощью where:**

In [31]:
sql = '''select t.*, i.item_name from users t
left join items i on t.id = i.user_id
where i.item_name is not null'''

In [32]:
select(sql)

   id    name item_name
0   1    gleb      hleb
1   3  tyrion      gold

**Добавим предмет в таблицу items:**

In [33]:
items = pd.DataFrame({'user_id': [1, 3, 3], 'item_name': ['hleb', 'gold', 'wine'], 'value': [5, 100, 20]})

In [34]:
items.to_sql('items', con, index=False, if_exists='replace')

3

In [35]:
sql = '''select * from items i'''

In [36]:
select(sql)

   user_id item_name  value
0        1      hleb      5
1        3      gold    100
2        3      wine     20

**И проверю inner join теперь:**

In [37]:
sql = '''select t.*, i.item_name from users t
join items i on t.id = i.user_id'''

In [38]:
select(sql)

   id    name item_name
0   1    gleb      hleb
1   3  tyrion      gold
2   3  tyrion      wine

**Добавлю стоимость к запросу:**

In [39]:
sql = '''select t.*, i.item_name, i.value from users t
left join items i on t.id = i.user_id'''

In [40]:
select(sql)

   id      name item_name  value
0   1      gleb      hleb    5.0
1   2  jon snow      None    NaN
2   3    tyrion      gold  100.0
3   3    tyrion      wine   20.0

#### Провекрка на дубликаты перед join`ом

**Добавлю доп поле в юзерс:**

In [41]:
users = pd.DataFrame({'id': [1, 2, 3], 'name': ['gleb', 'jon snow', 'tyrion'],
                      'victory': [2, 10, 1]})

In [42]:
users.to_sql('users', con, index=False, if_exists='replace')

3

In [43]:
sql = '''select * from users t'''

In [44]:
select(sql)

   id      name  victory
0   1      gleb        2
1   2  jon snow       10
2   3    tyrion        1

**Теперь выполним тот же запрос с подтягиванием поля (left join)**

In [45]:
sql = '''select t.*, i.item_name, i.value from users t
left join items i on t.id = i.user_id'''

In [46]:
t = select(sql)

In [47]:
t

   id      name  victory item_name  value
0   1      gleb        2      hleb    5.0
1   2  jon snow       10      None    NaN
2   3    tyrion        1      gold  100.0
3   3    tyrion        1      wine   20.0

**Посчитаем сумму побед:**

In [48]:
t.victory.sum()

14

**Если просто просуммировать поля в pandas ↑, то ответ будет НЕ ВЕРНЫМ! т.к. pandas НЕ УЧИТЫВАЕТ ДУБЛИКАТЫ в таком подсчёте**

**Если же просуммировать поля в SQL, то дубликаты будут учтены и результат будет верным! ↓**

In [49]:
sql = '''select sum(t.victory) from users t'''

In [50]:
select(sql)

   sum(t.victory)
0              13

**Пример НЕВЕРНОЙ группировки:**

In [51]:
sql = '''select t.id, t.name,
sum(t.victory) as victory_sum,
count(i.item_name) as item_cnt,
sum(i.value) as value_sum

from users t
left join items i on t.id = i.user_id
group by t.id, t.name'''

In [52]:
select(sql)

   id      name  victory_sum  item_cnt  value_sum
0   1      gleb            2         1        5.0
1   2  jon snow           10         0        NaN
2   3    tyrion            2         2      120.0

**НЕВЕРНО ↑ т.к. у тириона указано 2 победы, а на самом деле она 1.**

**ВЕРНАЯ ↓ группировка:**

In [55]:
sql = '''select t.id, t.name, t.victory,
count(i.item_name) as item_cnt,
sum(i.value) as value_sum

from users t
left join items i on t.id = i.user_id
group by t.id, t.name, t.victory'''

In [56]:
select(sql)

   id      name  victory  item_cnt  value_sum
0   1      gleb        2         1        5.0
1   2  jon snow       10         0        NaN
2   3    tyrion        1         2      120.0

**Теперь число побед ↑ указано верно!**

**Пример замены NaN: можно воспользоваться coalesce:**

In [57]:
sql = '''select t.id, t.name, t.victory,
count(i.item_name) as item_cnt,
coalesce(sum(i.value),0) as value_sum

from users t
left join items i on t.id = i.user_id
group by t.id, t.name, t.victory'''

In [58]:
select(sql)

   id      name  victory  item_cnt  value_sum
0   1      gleb        2         1          5
1   2  jon snow       10         0          0
2   3    tyrion        1         2        120

#### Агрегация перед join`ом
**Для того, чтобы избежать дубликатов, нужно: перед join`ом сагрегировать данные:**

**1. Агрегируем данные по юзерс перед join`om**

In [59]:
sql = '''select t.user_id, count(t.item_name) as item_cnt,
sum(value) as value_sum from items t
group by t.user_id'''

In [60]:
select(sql)

   user_id  item_cnt  value_sum
0        1         1          5
1        3         2        120

**2. Создаём CTE (with) (Command table expression) с уже агрегированными данными, которую назовём items_agg**

In [61]:
sql = '''
with items_agg as (
select t.user_id, count(t.item_name) as item_cnt,
sum(value) as value_sum from items t
group by t.user_id)

select * from items_agg t'''

In [62]:
select(sql)

   user_id  item_cnt  value_sum
0        1         1          5
1        3         2        120

**3. Join`им нужную таблицу**

In [63]:
sql = '''
with items_agg as (
select t.user_id, count(t.item_name) as item_cnt,
sum(value) as value_sum from items t
group by t.user_id)

select t.id, t.name, t.victory,
coalesce(i.item_cnt, 0) as item_cnt,
coalesce(i.value_sum, 0) as value_sum

from users t
left join items_agg i on t.id = i.user_id'''

In [64]:
select(sql)

   id      name  victory  item_cnt  value_sum
0   1      gleb        2         1          5
1   2  jon snow       10         0          0
2   3    tyrion        1         2        120

#### Как НЕ надо делать!

##### 1. Писать столбцы без псевдонимов либо полных наименований таблицы
**ВЕРНАЯ ЗАПИСЬ ↑: i.item_cnt, i.value_sum**
**У столбцов item.cnt и value_sum ↓ НЕ УКАЗАНЫ псевдонимы:**

In [69]:
sql = '''
with items_agg as (
select t.user_id, count(t.item_name) as item_cnt,
sum(value) as value_sum from items t
group by t.user_id)

select t.id, t.name, t.victory,
coalesce(item_cnt, 0) as item_cnt,
coalesce(value_sum, 0) as value_sum

from users t
left join items_agg i on t.id = i.user_id'''

In [70]:
select(sql)

   id      name  victory  item_cnt  value_sum
0   1      gleb        2         1          5
1   2  jon snow       10         0          0
2   3    tyrion        1         2        120

**Пересоздам табличку items для примера:**
Вместо user_id в ней будет id

In [71]:
items = pd.DataFrame({'id': [1, 3, 3], 'item_name': ['hleb', 'gold', 'wine'], 'value': [5, 100, 20]})

In [72]:
items.to_sql('items2', con, index=False, if_exists='replace')

3

**НЕ УКАЗАНЫ никакие псевдонимы ↓**

In [73]:
sql = '''select * from users
left join items on id = user_id '''

In [74]:
select(sql)

   id      name  victory  user_id item_name  value
0   1      gleb        2      1.0      hleb    5.0
1   2  jon snow       10      NaN      None    NaN
2   3    tyrion        1      3.0      gold  100.0
3   3    tyrion        1      3.0      wine   20.0

**В данном примере ↓ выполнить запрос уже не выйдет, т.к. SQL не может понять из какой таблицы нужно брать информацию**

In [75]:
sql = '''select * from users
left join items2 on id=id'''

In [76]:
# select(sql)

**Верная запись ↓ ПРЕДЫДУЩЕГО запроса**

In [77]:
sql = '''select * from users t
left join items2 i on t.id=i.id'''

In [78]:
select(sql)

   id      name  victory   id item_name  value
0   1      gleb        2  1.0      hleb    5.0
1   2  jon snow       10  NaN      None    NaN
2   3    tyrion        1  3.0      gold  100.0
3   3    tyrion        1  3.0      wine   20.0

##### 2. Использовать using

**Вместо using лучше использовать псевдонимы либо названия таблиц**

In [79]:
sql = '''select * from users
left join items2 using(id)'''

In [80]:
select(sql)

   id      name  victory item_name  value
0   1      gleb        2      hleb    5.0
1   2  jon snow       10      None    NaN
2   3    tyrion        1      gold  100.0
3   3    tyrion        1      wine   20.0

##### 3. Старый (неявный) join

In [81]:
sql = '''select * from users t, items2 i
where t.id = i.id'''

In [82]:
select(sql)

   id    name  victory  id item_name  value
0   1    gleb        2   1      hleb      5
1   3  tyrion        1   3      gold    100
2   3  tyrion        1   3      wine     20

#### НЕ используй Right Join
right join может отсутствовать в некоторых диалектах SQL!

**Заново добавлю users и items**

In [83]:
users = pd.DataFrame({'id': [1, 2, 3], 'name': ['gleb', 'jon snow', 'tyrion']})
items = pd.DataFrame({'user_id': [1, 3, 3, 4], 'item_name': ['hleb', 'gold', 'wine', 'sword'], 'value': [5, 100, 20, 50]})

In [84]:
users

   id      name
0   1      gleb
1   2  jon snow
2   3    tyrion

In [85]:
items

   user_id item_name  value
0        1      hleb      5
1        3      gold    100
2        3      wine     20
3        4     sword     50

In [86]:
items.to_sql('items', con, index=False, if_exists='replace')
users.to_sql('users', con, index=False, if_exists='replace')

3

In [87]:
sql = '''select * from users u'''

In [88]:
select(sql)

   id      name
0   1      gleb
1   2  jon snow
2   3    tyrion

In [89]:
sql = '''select * from items t'''

In [90]:
select(sql)

   user_id item_name  value
0        1      hleb      5
1        3      gold    100
2        3      wine     20
3        4     sword     50

**Запрос left join из users к items, то есть присоединяю items к users:**

In [91]:
sql = '''select t.*, i.* from users t
left join items i on t.id = i.user_id'''

In [92]:
select(sql)

   id      name  user_id item_name  value
0   1      gleb      1.0      hleb    5.0
1   2  jon snow      NaN      None    NaN
2   3    tyrion      3.0      gold  100.0
3   3    tyrion      3.0      wine   20.0

**Запрос left join из items к users, то есть присоединяю users к items:**

In [93]:
sql = '''select t.*, u.* from items t
left join users u on t.user_id = u.id'''

In [95]:
select(sql)

   user_id item_name  value   id    name
0        1      hleb      5  1.0    gleb
1        3      gold    100  3.0  tyrion
2        3      wine     20  3.0  tyrion
3        4     sword     50  NaN    None

**Для сравнения напишу Right join**

In [96]:
sql = '''select t.*, i.* from users t
right join items i on t.id = i.user_id'''

In [97]:
select(sql)

DatabaseError: Execution failed on sql 'select t.*, i.* from users t
right join items i on t.id = i.user_id': RIGHT and FULL OUTER JOINs are not currently supported

**По 4 id из таблицы users ничего не нашлось ↑**

##### Во избежании путаницы не стоит использовать Right join!!!

### Full join
Full join может отсутствовать в некоторых диалектах sql!
Для ознакомления:

In [98]:
sql = '''select t.*, i.* from users t
full join items i on t.id = i.user_id'''

In [99]:
select(sql)

DatabaseError: Execution failed on sql 'select t.*, i.* from users t
full join items i on t.id = i.user_id': RIGHT and FULL OUTER JOINs are not currently supported

**Full join можно имитировать с помощью union:**

In [100]:
sql = '''select t.*, i.* from users t
left join items i on t.id = i.user_id
union
select u.*, t.* from items t
left join users u on t.user_id = u.id'''

In [101]:
select(sql)

    id      name  user_id item_name  value
0  NaN      None      4.0     sword   50.0
1  1.0      gleb      1.0      hleb    5.0
2  2.0  jon snow      NaN      None    NaN
3  3.0    tyrion      3.0      gold  100.0
4  3.0    tyrion      3.0      wine   20.0

### Inner join

In [102]:
sql = '''select * from german_credit t limit 5'''

In [103]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358

In [104]:
clients = pd.DataFrame({'client_id': [200, 45], 'data': [1, 2]})

In [105]:
clients.to_sql('clients_task_name', con, index=False, if_exists='replace')

2

**Для фильтрации использую inner join:**

In [106]:
sql = '''select t.*, ctn.data from german_credit t
join clients_task_name ctn on t.client_id = ctn.client_id'''

In [107]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id,data
0,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200,1
1,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45,2

**Пример хардкода для создания таблиц**

In [108]:
sql = '''select 1 as user_id'''

In [109]:
select(sql)

   user_id
0        1

In [110]:
sql = '''select 1 as user_id
union all
select 2 as user_id
union all
select 3 as user_id'''

In [111]:
select(sql)

   user_id
0        1
1        2
2        3

In [112]:
sql = '''select date('2023-03-01') as month
union all
select date('2023-04-01') as month'''

In [113]:
select(sql)

        month
0  2023-03-01
1  2023-04-01

**Пример cross join:**

In [114]:
sql = '''
with users as (
select 1 as user_id
union all
select 2 as user_id
union all
select 3 as user_id),
month as

(select date('2023-03-01') as month
union all
select date('2023-04-01') as month)

select * from users t
join month m on 1=1'''

In [115]:
select(sql)

   user_id       month
0        1  2023-03-01
1        2  2023-03-01
2        3  2023-03-01
3        1  2023-04-01
4        2  2023-04-01
5        3  2023-04-01

### Practice

In [116]:
transactions = pd.read_csv('german_credit_augmented_transactions.csv')

In [117]:
transactions.head()

                    dt  client_id  amount
0  2008-04-06 11:54:47        950  161.38
1  2007-07-28 00:00:19        418   35.34
2  2008-03-14 20:43:54        131  146.50
3  2007-12-18 13:03:24        353  119.21
4  2007-11-09 05:18:30        849  105.24

Загрузка в SQL

In [118]:
transactions.to_sql('client_transactions', con, index=False, if_exists='replace')

4275

In [121]:
sql = '''select * from client_transactions t limit 5'''

In [122]:
select(sql)

                    dt  client_id  amount
0  2008-04-06 11:54:47        950  161.38
1  2007-07-28 00:00:19        418   35.34
2  2008-03-14 20:43:54        131  146.50
3  2007-12-18 13:03:24        353  119.21
4  2007-11-09 05:18:30        849  105.24

In [123]:
sql = '''select count(*) from client_transactions t limit 5'''

In [124]:
select(sql)

   count(*)
0      4275

In [125]:
sql = '''select t.*, date(t.dt, 'start of month') as month from client_transactions t limit 5'''

In [126]:
select(sql)

                    dt  client_id  amount       month
0  2008-04-06 11:54:47        950  161.38  2008-04-01
1  2007-07-28 00:00:19        418   35.34  2007-07-01
2  2008-03-14 20:43:54        131  146.50  2008-03-01
3  2007-12-18 13:03:24        353  119.21  2007-12-01
4  2007-11-09 05:18:30        849  105.24  2007-11-01

In [139]:
sql = '''select date(t.dt, 'start of month') as month,
count(*) as transaction_cnt,
sum(t.amount) as amount_sum

from client_transactions t
group by date(t.dt, 'start of month')
order by date(t.dt, 'start of month')'''

In [140]:
select(sql)

         month  transaction_cnt  amount_sum
0   2007-05-01              338   450912.77
1   2007-06-01              379   551664.83
2   2007-07-01              304   494134.50
3   2007-08-01              255   426903.23
4   2007-10-01              332   634846.49
5   2007-11-01              389   500420.98
6   2007-12-01              364   561449.89
7   2008-01-01              413   630137.22
8   2008-02-01              228   337043.47
9   2008-03-01              309   425599.09
10  2008-04-01              383   677194.97
11  2008-05-01              310   474962.34
12  2008-06-01              271   383710.84

В отчёте не учитываются нули! ↑ Например нет сентября в 2007 году

Сгенерируем диапазон дат, между пропущенными датами:
Вариант хардкода:

In [141]:
sql = f'''WITH RECURSIVE dates(month) AS (
  VALUES('2007-05-01')
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ('2008-06-01')
)
SELECT t.month FROM dates t'''

In [142]:
select(sql)

         month
0   2007-05-01
1   2007-06-01
2   2007-07-01
3   2007-08-01
4   2007-09-01
5   2007-10-01
6   2007-11-01
7   2007-12-01
8   2008-01-01
9   2008-02-01
10  2008-03-01
11  2008-04-01
12  2008-05-01
13  2008-06-01

Использую подзапрос для генерации дат:

In [162]:
mini = '''select date(min(t.dt), 'start of month') from client_transactions t'''
maxi = '''select date(max(t.dt), 'start of month') from client_transactions t'''

In [165]:
sql = f'''WITH dates(month) AS (
  VALUES(({mini}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({maxi})
)
SELECT t.month FROM dates t'''

In [166]:
select(sql)

         month
0   2007-05-01
1   2007-06-01
2   2007-07-01
3   2007-08-01
4   2007-09-01
5   2007-10-01
6   2007-11-01
7   2007-12-01
8   2008-01-01
9   2008-02-01
10  2008-03-01
11  2008-04-01
12  2008-05-01
13  2008-06-01

In [177]:
sql = f'''WITH dates(month) AS (
  VALUES(({mini}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({maxi})
),
trans_month as
(select date(t.dt, 'start of month') as month,
count(*) as transaction_cnt,
sum(t.amount) as amount_sum

from client_transactions t
group by date(t.dt, 'start of month')
order by date(t.dt, 'start of month'))

SELECT t.month,
coalesce(tm.transaction_cnt,0) as transaction_cnt,
coalesce(tm.amount_sum, 0) as amount_sum
FROM dates t
left join trans_month tm on t.month = tm.month
order by t.month'''

In [178]:
select(sql)

         month  transaction_cnt  amount_sum
0   2007-05-01              338   450912.77
1   2007-06-01              379   551664.83
2   2007-07-01              304   494134.50
3   2007-08-01              255   426903.23
4   2007-09-01                0        0.00
5   2007-10-01              332   634846.49
6   2007-11-01              389   500420.98
7   2007-12-01              364   561449.89
8   2008-01-01              413   630137.22
9   2008-02-01              228   337043.47
10  2008-03-01              309   425599.09
11  2008-04-01              383   677194.97
12  2008-05-01              310   474962.34
13  2008-06-01              271   383710.84

Теперь в отчёте есть все даты и все пропуски зафиксированы!

### Practice. Ежемесячный отчёт на пользователя